#!/bin/bash

# Настройки
DB_NAME="база_данных"
DB_USER="пользователь"
BACKUP_DIR="/путь/к/директории/бэкапов"
REMOTE_SERVER="пользователь@удаленный_сервер:/путь/к/удаленной/директории"
DATE=$(date +"%Y%m%d%H%M%S")
BACKUP_FILE="${BACKUP_DIR}/${DB_NAME}_backup_${DATE}.sql.gz"

# Создание бэкапа
echo "Создание бэкапа базы данных ${DB_NAME}..."
pg_dump -U ${DB_USER} -F c ${DB_NAME} | gzip > ${BACKUP_FILE}

# Проверка успешности создания бэкапа
if [ $? -ne 0 ]; then
  echo "Ошибка при создании бэкапа!"
  exit 1
fi

# Копирование бэкапа на удаленный сервер
echo "Копирование бэкапа на удаленный сервер..."
scp ${BACKUP_FILE} ${REMOTE_SERVER}

# Проверка успешности копирования
if [ $? -ne 0 ]; then
  echo "Ошибка при копировании бэкапа на удаленный сервер!"
  exit 1
fi

# Удаление локального бэкапа после успешного копирования
rm ${BACKUP_FILE}

# Удаление старых бэкапов, оставляя только 3 последних
echo "Удаление старых бэкапов, оставляя только 3 последних..."
cd ${BACKUP_DIR}
ls -tp ${DB_NAME}_backup_*.sql.gz | grep -v '/$' | awk 'NR>3' | xargs -I {} rm -- {}

echo "Бэкап завершен успешно!"
